In [1]:
import pandas as pd

In [33]:
s1 = pd.Series(['A','B','C','D'], index=[4,3,2,1])
s1

4    A
3    B
2    C
1    D
dtype: object

In [30]:
s1.iloc[0:-2]

4    A
3    B
dtype: object

In [10]:
s1.describe()

count     4
unique    4
top       C
freq      1
dtype: object

In [42]:
data = { "name": ['A', 'B', 'C'],
         "age": [10, 20, 30],
         "salary": [10000, 20000, 30000]
       }
data = pd.DataFrame(data, columns=['name', 'age', 'salary'])
data

  name  age  salary
0    A   10   10000
1    B   20   20000
2    C   30   30000

In [36]:
data.T

            0      1      2
age        10     20     30
name        A      B      C
salary  10000  20000  30000

In [37]:
data.name

0    A
1    B
2    C
Name: name, dtype: object

In [38]:
data['name']

0    A
1    B
2    C
Name: name, dtype: object

In [39]:
data.describe()

        age   salary
count   3.0      3.0
mean   20.0  20000.0
std    10.0  10000.0
min    10.0  10000.0
25%    15.0  15000.0
50%    20.0  20000.0
75%    25.0  25000.0
max    30.0  30000.0

In [40]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
age       3 non-null int64
name      3 non-null object
salary    3 non-null int64
dtypes: int64(2), object(1)
memory usage: 152.0+ bytes

In [43]:
data.columns

Index(['name', 'age', 'salary'], dtype='object')

In [45]:
data.index

RangeIndex(start=0, stop=3, step=1)

In [55]:
data.sort_values(by='salary', ascending=False).iloc[:1]

  name  age  salary
2    C   30   30000